# What is Pandas?

Pandas is one of the most important libraries of Python.

Pandas has data structures for easy data analysis. The most used of these are Series and DataFrame data structures. Series data structure is one dimensional, that is, it consists of a column. DataFrame data structure is two-dimensional, i.e. it consists of rows and columns.

To install Pandas you can use "pip install pandas"

In [1]:
import pandas as pd # Let's import pandas with pd
import numpy as np

In [2]:
pd.__version__ # To print the installed vesion pandas

'1.4.4'

# Pandas Data Structure
To get started with pandas, you will need to get comfortable with its two workhorse data structures: **Series** and **DataFrame**. While they are not a universal solution for every problem, they provide a solid foundation for a wide variety of data tasks. <br>

## Series
A Series is a one-dimensional array-like object containing a sequence of values (of similar types to NumPy types) of the same type and an associated array of data labels, called its index. The simplest Series is formed from only an array of data:

In [3]:
s = pd.Series([-2, -1, 0, 1, 2])
s

0   -2
1   -1
2    0
3    1
4    2
dtype: int64

### Array Representation
You can get the array representation and index object of the Series via its array and index attributes, respectively:

In [4]:
s.array

<PandasArray>
[-2, -1, 0, 1, 2]
Length: 5, dtype: int64

In [5]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
ms=pd.Series([1,"John",3.5,"Hey"])
ms

0       1
1    John
2     3.5
3     Hey
dtype: object

**Indexing pandas series**

In [7]:
ms[0]

1

In [8]:
ms[3]

'Hey'

In [9]:
ms[-1]

KeyError: -1

In [10]:
s.values

array([-2, -1,  0,  1,  2], dtype=int64)

### Labels
Often, you’ll want to create a Series with an index identifying each data point with a label.

In [11]:
swb = pd.Series([1,"John",3.5,"Hey"],index=["a","b","c","d"])
swb

a       1
b    John
c     3.5
d     Hey
dtype: object

In [12]:
swb["b"]

'John'

In [13]:
swb[["a", "b", "d"]]

a       1
b    John
d     Hey
dtype: object

In [14]:
swb.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [15]:
series.index = [0, -1, 2, 3, 4]

NameError: name 'series' is not defined

In [16]:
series.index

NameError: name 'series' is not defined

In [17]:
series[-1]

NameError: name 'series' is not defined

### Series & Dictionaries
Another way to think about a Series is as a fixed-length, ordered dictionary, as it is a mapping of index values to data values. It can be used in many contexts where you might use a dictionary:

In [18]:
score = {"Mohsin":90, "Qasim":80,"Sajid":85,"Usman":75,"Muneeb":95}
score

{'Mohsin': 90, 'Qasim': 80, 'Sajid': 85, 'Usman': 75, 'Muneeb': 95}

In [19]:
names = pd.Series(score) # Convert to Series 
names

Mohsin    90
Qasim     80
Sajid     85
Usman     75
Muneeb    95
dtype: int64

In [20]:
names["Sajid"]

85

**We can also convert a Series to Dictionary**

In [21]:
names.to_dict()         # Converting series back to Dictionary

{'Mohsin': 90, 'Qasim': 80, 'Sajid': 85, 'Usman': 75, 'Muneeb': 95}

In [22]:
index_list = ["Usman", "Sohail", "Muneeb", "Mohsin"]
names_2 = pd.Series(score, index = index_list)
names_2

Usman     75.0
Sohail     NaN
Muneeb    95.0
Mohsin    90.0
dtype: float64

### Operations on Series

In [23]:
names[names >= 85]

Mohsin    90
Sajid     85
Muneeb    95
dtype: int64

In [24]:
names["Tom"] = 60
names

Mohsin    90
Qasim     80
Sajid     85
Usman     75
Muneeb    95
Tom       60
dtype: int64

In [25]:
names[names <= 80] = 83
names

Mohsin    90
Qasim     83
Sajid     85
Usman     83
Muneeb    95
Tom       83
dtype: int64

In [26]:
"Qasim" in names

True

In [27]:
"Qasim" in names_2

False

In [28]:
names/10

Mohsin    9.0
Qasim     8.3
Sajid     8.5
Usman     8.3
Muneeb    9.5
Tom       8.3
dtype: float64

In [29]:
names**2

Mohsin    8100
Qasim     6889
Sajid     7225
Usman     6889
Muneeb    9025
Tom       6889
dtype: int64

In [30]:
names.isnull()

Mohsin    False
Qasim     False
Sajid     False
Usman     False
Muneeb    False
Tom       False
dtype: bool

In [31]:
names["Muneeb"] = None

In [32]:
names.isnull()

Mohsin    False
Qasim     False
Sajid     False
Usman     False
Muneeb     True
Tom       False
dtype: bool

In [33]:
pd.isna(names)

Mohsin    False
Qasim     False
Sajid     False
Usman     False
Muneeb     True
Tom       False
dtype: bool

In [34]:
pd.isna(names_2)

Usman     False
Sohail     True
Muneeb    False
Mohsin    False
dtype: bool

In [35]:
pd.notna(names_2)

Usman      True
Sohail    False
Muneeb     True
Mohsin     True
dtype: bool

In [36]:
names_2.isna()

Usman     False
Sohail     True
Muneeb    False
Mohsin    False
dtype: bool

In [37]:
names_2.notna()

Usman      True
Sohail    False
Muneeb     True
Mohsin     True
dtype: bool

In [38]:
names.name = "Scoring List"
names

Mohsin    90.0
Qasim     83.0
Sajid     85.0
Usman     83.0
Muneeb     NaN
Tom       83.0
Name: Scoring List, dtype: float64

In [39]:
names.index.name = "Players"
names

Players
Mohsin    90.0
Qasim     83.0
Sajid     85.0
Usman     83.0
Muneeb     NaN
Tom       83.0
Name: Scoring List, dtype: float64

# DataFrame
## What is DataFrame?
A DataFrame represents a rectangular table of data and contains an ordered, named collection of columns, each of which can be a different value type (numeric, string, Boolean, etc.). The DataFrame has both a row and column index; it can be thought of as a dictionary of Series all sharing the same index.

In [40]:
#Read a comma-separated values (csv) file into DataFrame
sales = pd.read_csv("OneDrive/Desktop/New folder/Session3/dataset/vgsales.csv")

In [41]:
pd.options.display.max_rows = 20      # Similarly we can set minimum number of rows
sales

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [42]:
sales.columns        # To View the Columns

Index(['Rank', 'Name', 'Platform', 'Year', 'Genre', 'Publisher', 'NA_Sales',
       'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales'],
      dtype='object')

In [45]:
cols = ["Rank", "Name", "Platform", "Year", "EU_Sales"]

In [46]:
sales[cols].dtypes

Rank          int64
Name         object
Platform     object
Year        float64
EU_Sales    float64
dtype: object

In [47]:
sales[cols].memory_usage(deep = True)   # Return the memory usage of each column in bytes.

Index           128
Rank         132784
Name        1345088
Platform     992008
Year         132784
EU_Sales     132784
dtype: int64

In [48]:
sales.memory_usage(deep = True).sum()

5501446

In [49]:
sales.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [50]:
sales.tail()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.0,0.0,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.0,0.0,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.0,0.0,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.0,0.0,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.0,0.0,0.01

In [51]:
sales.dtypes

Rank              int64
Name             object
Platform         object
Year            float64
Genre            object
Publisher        object
NA_Sales        float64
EU_Sales        float64
JP_Sales        float64
Other_Sales     float64
Global_Sales    float64
dtype: object

In [52]:
sales.describe()

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,16598.000000,16327.000000,16598.000000,16598.000000,16598.000000,16598.000000,16598.000000
mean,8300.605254,2006.406443,0.264667,0.146652,0.077782,0.048063,0.537441
std,4791.853933,5.828981,0.816683,0.505351,0.309291,0.188588,1.555028
min,1.000000,1980.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,4151.250000,2003.000000,0.000000,0.000000,0.000000,0.000000,0.060000
50%,8300.500000,2007.000000,0.080000,0.020000,0.000000,0.010000,0.170000
75%,12449.750000,2010.000000,0.240000,0.110000,0.040000,0.040000,0.470000
max,16600.000000,2020.000000,41.490000,29.020000,10.220000,10.570000,82.740000

In [53]:
sales[cols].select_dtypes("object").describe()

                               Name Platform
count                         16598    16598
unique                        11493       31
top     Need for Speed: Most Wanted       DS
freq                             12     2163

In [54]:
# Chaining
(
    sales
    [cols]
    .select_dtypes("float")
    .describe()  
)

               Year      EU_Sales
count  16327.000000  16598.000000
mean    2006.406443      0.146652
std        5.828981      0.505351
min     1980.000000      0.000000
25%     2003.000000      0.000000
50%     2007.000000      0.020000
75%     2010.000000      0.110000
max     2020.000000     29.020000

For numeric data, the result’s index will include **count, mean, std, min, max as well as lower, 50 and upper percentiles**. By default the lower percentile is 25 and the upper percentile is 75. The 50 percentile is the same as the median.

In [55]:
sales.Year.describe()

count    16327.000000
mean      2006.406443
std          5.828981
min       1980.000000
25%       2003.000000
50%       2007.000000
75%       2010.000000
max       2020.000000
Name: Year, dtype: float64

For object data (e.g. strings or timestamps), the result’s index will include **count, unique, top, and freq**. The top is the most common value. The freq is the most common value’s frequency. Timestamps also include the first and last items.

In [56]:
sales.Platform.describe()

count     16598
unique       31
top          DS
freq       2163
Name: Platform, dtype: object

In [57]:
# Return a Series containing counts of unique rows in the DataFrame.
sales.Genre.value_counts()

Action          3316
Sports          2346
Misc            1739
Role-Playing    1488
Shooter         1310
Adventure       1286
Racing          1249
Platform         886
Simulation       867
Fighting         848
Strategy         681
Puzzle           582
Name: Genre, dtype: int64

In [58]:
sales.Genre.value_counts(normalize=True)

Action          0.199783
Sports          0.141342
Misc            0.104772
Role-Playing    0.089649
Shooter         0.078925
Adventure       0.077479
Racing          0.075250
Platform        0.053380
Simulation      0.052235
Fighting        0.051090
Strategy        0.041029
Puzzle          0.035064
Name: Genre, dtype: float64

In [59]:
type(sales.Genre.value_counts())

pandas.core.series.Series

In [60]:
sales.Genre.value_counts().head()

Action          3316
Sports          2346
Misc            1739
Role-Playing    1488
Shooter         1310
Name: Genre, dtype: int64

In [61]:
sales.Genre.unique()

array(['Sports', 'Platform', 'Racing', 'Role-Playing', 'Puzzle', 'Misc',
       'Shooter', 'Simulation', 'Action', 'Fighting', 'Adventure',
       'Strategy'], dtype=object)

In [62]:
sales.Genre.nunique()

12

### Dataframe from Dictionary
The resulting DataFrame will have its index assigned automatically, as with Series, and the columns are placed according to the order of the keys in data (which depends on their insertion order in the dictionary):

In [63]:
# Creating dataframe from dictionary
data = {"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],      
      "score":[90,80,85,75,95,60,65],      
      "sport":["Wrestling","Football","Skiing","Swimming","Tennis",
               "Karete","Surfing"],      
      "sex":["M","M","M","M","F","F","F"]}
df = pd.DataFrame(data)
df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [64]:
# Create dataframe and set columns separately
df = pd.DataFrame(data,columns=["name","sport","sex","score"])
df

      name      sport sex  score
0     Bill  Wrestling   M     90
1      Tom   Football   M     80
2      Tim     Skiing   M     85
3     John   Swimming   M     75
4     Alex     Tennis   F     95
5  Vanessa     Karete   F     60
6     Kate    Surfing   F     65

In [65]:
# Creating dataframe from dictionar and setting columns
# Note: It maps the columns with dictionary keys and gives NaN value to new columns
df = pd.DataFrame(data, columns = ["name", "sport", "gender", "score", "age"])
df

      name      sport gender  score  age
0     Bill  Wrestling    NaN     90  NaN
1      Tom   Football    NaN     80  NaN
2      Tim     Skiing    NaN     85  NaN
3     John   Swimming    NaN     75  NaN
4     Alex     Tennis    NaN     95  NaN
5  Vanessa     Karete    NaN     60  NaN
6     Kate    Surfing    NaN     65  NaN

In [66]:
# Setting index labels while creating dataframe

df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"],
                index=["one","two","three","four","five","six","seven"])
df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90  NaN
two        Tom   Football    NaN     80  NaN
three      Tim     Skiing    NaN     85  NaN
four      John   Swimming    NaN     75  NaN
five      Alex     Tennis    NaN     95  NaN
six    Vanessa     Karete    NaN     60  NaN
seven     Kate    Surfing    NaN     65  NaN

In [67]:
# Columns can be assigned a scalar value or an array of values:
df["age"] = 28

df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90   28
two        Tom   Football    NaN     80   28
three      Tim     Skiing    NaN     85   28
four      John   Swimming    NaN     75   28
five      Alex     Tennis    NaN     95   28
six    Vanessa     Karete    NaN     60   28
seven     Kate    Surfing    NaN     65   28

In [68]:
df["age"] = np.arange(7)
df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90    0
two        Tom   Football    NaN     80    1
three      Tim     Skiing    NaN     85    2
four      John   Swimming    NaN     75    3
five      Alex     Tennis    NaN     95    4
six    Vanessa     Karete    NaN     60    5
seven     Kate    Surfing    NaN     65    6

When you are assigning lists or arrays to a column, the value’s length must match the length of the DataFrame. If you assign a  series, its labels will be realigned exactly to the DataFrame’s index, inserting missing values in any index values not present:

In [69]:
age = pd.Series([22, 29, 30, 32, 33, 27, 25], index=["one", "two", "three", "four", "five", "six", "seven"])
df["age"] = age

df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90   22
two        Tom   Football    NaN     80   29
three      Tim     Skiing    NaN     85   30
four      John   Swimming    NaN     75   32
five      Alex     Tennis    NaN     95   33
six    Vanessa     Karete    NaN     60   27
seven     Kate    Surfing    NaN     65   25

A column in a DataFrame can be retrieved as a Series either by dictionary-like notation or by using the dot attribute notation:

In [70]:
df["name"]

one         Bill
two          Tom
three        Tim
four        John
five        Alex
six      Vanessa
seven       Kate
Name: name, dtype: object

In [71]:
df.name

one         Bill
two          Tom
three        Tim
four        John
five        Alex
six      Vanessa
seven       Kate
Name: name, dtype: object

In [72]:
df["young"] = df["age"] >= 30
df

          name      sport gender  score  age  young
one       Bill  Wrestling    NaN     90   22  False
two        Tom   Football    NaN     80   29  False
three      Tim     Skiing    NaN     85   30   True
four      John   Swimming    NaN     75   32   True
five      Alex     Tennis    NaN     95   33   True
six    Vanessa     Karete    NaN     60   27  False
seven     Kate    Surfing    NaN     65   25  False

In [74]:
# The del keyword will delete columns like with a dictionary.

del df["young"]
df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90   22
two        Tom   Football    NaN     80   29
three      Tim     Skiing    NaN     85   30
four      John   Swimming    NaN     75   32
five      Alex     Tennis    NaN     95   33
six    Vanessa     Karete    NaN     60   27
seven     Kate    Surfing    NaN     65   25

### Operations on dataframe

In [75]:
# You may index arbitrary columns 
my_columns=["name","sport"]
df[my_columns]

          name      sport
one       Bill  Wrestling
two        Tom   Football
three      Tim     Skiing
four      John   Swimming
five      Alex     Tennis
six    Vanessa     Karete
seven     Kate    Surfing

In [76]:
# Access a single value for a row/column pair by label.
df.at["two", "score"]

80

In [77]:
# Access a single value for a row/column pair by integer position.
df.iat[1, 3]

80

In [78]:
# Access group of values using index labels.
df.loc[["one"]]

     name      sport gender  score  age
one  Bill  Wrestling    NaN     90   22

In [79]:
# You may get rows with arbitrary index labels like columns 
df.loc[["one","two"]]

     name      sport gender  score  age
one  Bill  Wrestling    NaN     90   22
two   Tom   Football    NaN     80   29

In [80]:
# Access group of rows and columns by integer position(s).
df.iloc[1]

name           Tom
sport     Football
gender         NaN
score           80
age             29
Name: two, dtype: object

In [81]:
df.iloc[[0, 1, 2]]

       name      sport gender  score  age
one    Bill  Wrestling    NaN     90   22
two     Tom   Football    NaN     80   29
three   Tim     Skiing    NaN     85   30

# Indexing-Selection-Filtering in Pandas Library

## DataFrame Indexing

In [82]:
data = pd.DataFrame(
                        np.arange(16).reshape(4,4),
                        index=["Topi","Ghazi","Swabi","Gadoon"],
                        columns=["one","two","three","four"]
                    )
data

        one  two  three  four
Topi      0    1      2     3
Ghazi     4    5      6     7
Swabi     8    9     10    11
Gadoon   12   13     14    15

In [83]:
data["two"]

Topi       1
Ghazi      5
Swabi      9
Gadoon    13
Name: two, dtype: int32

In [84]:
data[["one","two"]]

        one  two
Topi      0    1
Ghazi     4    5
Swabi     8    9
Gadoon   12   13

In [85]:
# Slicing records from dataframe
data[:3]

       one  two  three  four
Topi     0    1      2     3
Ghazi    4    5      6     7
Swabi    8    9     10    11

**Operations on dataframe**

In [86]:
data[data["four"]>5]

        one  two  three  four
Ghazi     4    5      6     7
Swabi     8    9     10    11
Gadoon   12   13     14    15

In [87]:
data[data<5] = 0
data

        one  two  three  four
Topi      0    0      0     0
Ghazi     0    5      6     7
Swabi     8    9     10    11
Gadoon   12   13     14    15

## Selecting with iloc and loc

In [88]:
data.iloc[1]

one      0
two      5
three    6
four     7
Name: Ghazi, dtype: int32

In [89]:
data.iloc[1,[1,2,3]]

two      5
three    6
four     7
Name: Ghazi, dtype: int32

In [90]:
data.iloc[[1,3],[1,2,3]]

        two  three  four
Ghazi     5      6     7
Gadoon   13     14    15

In [91]:
data.loc["Topi",["one","two"]]

one    0
two    0
Name: Topi, dtype: int32

In [92]:
data.loc[:"Ghazi","four"]

Topi     0
Ghazi    7
Name: four, dtype: int32

# Important Methods in Pandas

In [93]:
df=pd.DataFrame(
                    np.arange(9).reshape(3,3),
                    index=["a","c","d"],
                    columns=["Imran","Nawaz","Shahbaz"]
                )
df

   Imran  Nawaz  Shahbaz
a      0      1        2
c      3      4        5
d      6      7        8

In [94]:
# Set new indexes for the dataframe
# Note: New indexes that do not have corresponding records in the dataframe are assigned NaN
df2 = df.reindex(["d","c","b","a"])
df2

   Imran  Nawaz  Shahbaz
d    6.0    7.0      8.0
c    3.0    4.0      5.0
b    NaN    NaN      NaN
a    0.0    1.0      2.0

In [95]:
# Getting records using index labels with .loc
df.loc[["c","d","a"]]

   Imran  Nawaz  Shahbaz
c      3      4        5
d      6      7        8
a      0      1        2

In [123]:
data = pd.DataFrame(
                        np.arange(16).reshape(4,4),
                        index=["Apple","Orange","Mango","PineApple"],
                        columns=list("AbCd")
                    )
data

            A   b   C   d
Apple       0   1   2   3
Orange      4   5   6   7
Mango       8   9  10  11
PineApple  12  13  14  15

In [124]:
# Dropping certian rows using index labels from your dataframe
data.drop(["Apple","Orange"])

            A   b   C   d
Mango       8   9  10  11
PineApple  12  13  14  15

In [125]:
data.drop(["Apple", "Orange"], inplace=True)
data

            A   b   C   d
Mango       8   9  10  11
PineApple  12  13  14  15

In [126]:
# Drop column A from all records
# Note: axis defines the row or column (axis = 1 means column, axis=0 means row)
data.drop("A",axis=1)

            b   C   d
Mango       9  10  11
PineApple  13  14  15

In [127]:
data.drop("Mango",axis=0)

            A   b   C   d
PineApple  12  13  14  15

## Applying a Function

In [128]:
df = pd.DataFrame (
                    np.random.randn(4,3),
                    columns=list("ABC"),
                    index=["Akram","Anwar","Akbar","Asghar"])
df

               A         B         C
Akram  -0.500166  0.429627 -0.302217
Anwar   0.065767  1.456868  1.041871
Akbar  -1.187147  2.696974 -0.489911
Asghar  0.748091 -0.826180  0.171285

In [129]:
# Setting absolute values
np.abs(df)

               A         B         C
Akram   0.500166  0.429627  0.302217
Anwar   0.065767  1.456868  1.041871
Akbar   1.187147  2.696974  0.489911
Asghar  0.748091  0.826180  0.171285

In [130]:
# Defining lambda function that, will subtract max value from min in a column
f = lambda x:x.max()-x.min()

In [131]:
#Applying function on dataframe
df.apply(f)

A    1.935238
B    3.523155
C    1.531782
dtype: float64

In [132]:
df.apply(f,axis=1)

Akram     0.929793
Anwar     1.391101
Akbar     3.884121
Asghar    1.574272
dtype: float64

In [133]:
# Take square of all the values in dataframe
def f(x):
    return x**2

In [134]:
df.apply(f)

               A         B         C
Akram   0.250166  0.184580  0.091335
Anwar   0.004325  2.122465  1.085495
Akbar   1.409318  7.273671  0.240013
Asghar  0.559640  0.682574  0.029339

# Sorting and Ranking

In [137]:
df = pd.DataFrame (
                        np.arange(12).reshape(3,4),
                        index=[3,2,1],
                        columns=["d","a","b","c"]
                  )
df

   d  a   b   c
3  0  1   2   3
2  4  5   6   7
1  8  9  10  11

In [138]:
# Sorting dataframe by label
df.sort_index()

   d  a   b   c
1  8  9  10  11
2  4  5   6   7
3  0  1   2   3

In [139]:
# Sorting dataframe by column
df.sort_index(axis=1)

   a   b   c  d
3  1   2   3  0
2  5   6   7  4
1  9  10  11  8

In [140]:
df.sort_index(axis=1, ascending=False)

   d   c   b  a
3  0   3   2  1
2  4   7   6  5
1  8  11  10  9

## Practice
Let's practice using a real data set. You can download data set from https://www.kaggle.com/melodyxyz/global.

In [141]:
data=pd.read_csv("OneDrive/Desktop/New folder/Session3/dataset/movies.csv")

In [142]:
data.head()

,name,category,amazon_link,total_mentions,subreddit_mentions
0,Marvel Cinematic Universe: Phase One - Avenger...,Movies & TV,https://www.amazon.com/Marvel-Cinematic-Univer...,4.0,3
1,On Stranger Tides,Books,https://www.amazon.com/Stranger-Tides-Tim-Powe...,3.0,3
2,"Superintelligence: Paths, Dangers, Strategies",Books,https://www.amazon.com/Superintelligence-Dange...,7.0,2
3,The Secret History of Star Wars,Books,https://www.amazon.com/Secret-History-Star-War...,4.0,2
4,2D Glasses 4 Pack - Turns 3D movies back into ...,Electronics,https://www.amazon.com/gp/product/B00K9E7GCC,3.0,2

In [144]:
data["name"].sort_values(ascending=False)

229                  mrs. frisby and the rats of n i m h
118    iScholar Gross Pack Pencils, #2, Yellow, 288 P...
72     You Look Like That Girl: A Child Actor Stops P...
139    X-Men: The Complete Age of Apocalypse Epic, Bo...
239    X-Men Shape Shifters: Wolverine 7" Poseable Ac...
                             ...
274              1001 Movies You Must See Before You Die
217              1001 Movies You Must See Before You Die
158     100 All-Time Favorite Movies of the 20th Century
129    "I Heard You Paint Houses": Frank "The Irishma...
169    "I Heard You Paint Houses", Updated Edition: F...
Name: name, Length: 303, dtype: object

In [145]:
data.sort_values("name")

,name,category,amazon_link,total_mentions,subreddit_mentions
169,"""I Heard You Paint Houses"", Updated Edition: F...",Books,https://www.amazon.com/dp/1586422383/ref=cm_sw...,1.0,1
129,"""I Heard You Paint Houses"": Frank ""The Irishma...",Books,https://www.amazon.com/Heard-You-Paint-Houses-...,1.0,1
158,100 All-Time Favorite Movies of the 20th Century,Books,https://www.amazon.com/All-Time-Favorite-Movie...,1.0,1
274,1001 Movies You Must See Before You Die,Books,https://www.amazon.com/1001-Movies-You-Must-Be...,1.0,1
217,1001 Movies You Must See Before You Die,Books,https://www.amazon.com/1001-Movies-You-Must-Be...,1.0,1
...,...,...,...,...,...
239,"X-Men Shape Shifters: Wolverine 7"" Poseable Ac...",Toys & Games,https://www.amazon.com/X-Men-Shape-Shifters-Tr...,1.0,1
139,"X-Men: The Complete Age of Apocalypse Epic, Bo...",Books,https://www.amazon.com/X-Men-Complete-Apocalyp...,1.0,1
72,You Look Like That Girl: A Child Actor Stops P...,Books,https://www.amazon.com/You-Look-Like-That-Girl...,1.0,1
118,"iScholar Gross Pack Pencils, #2, Yellow, 288 P...","Arts, Crafts & Sewing",https://www.amazon.com/dp/B01L0D088O/ref=twist...,1.0,1
229,mrs. frisby and the rats of n i m h,Books,https://www.amazon.com/mrs-frisby-rats-robert-...,1.0,1

In [146]:
data.sort_values("category")

,name,category,amazon_link,total_mentions,subreddit_mentions
118,"iScholar Gross Pack Pencils, #2, Yellow, 288 P...","Arts, Crafts & Sewing",https://www.amazon.com/dp/B01L0D088O/ref=twist...,1.0,1
13,Chemical Guys MIC_493 Chenille Microfiber Prem...,Automotive Parts & Accessories,https://www.amazon.com/Chemical-Guys-Chenille-...,8.0,1
137,Suavecito Pomade Firme (Strong) Hold 4 oz,Beauty & Personal Care,https://www.amazon.com/gp/product/B008LD8ZGO/r...,1.0,1
166,Ganesha's Sweet Tooth,Books,https://www.amazon.com/Ganeshas-Sweet-Tooth-Em...,1.0,1
142,Danse Macabre,Books,https://www.amazon.com/Danse-Macabre-Stephen-K...,1.0,1
...,...,...,...,...,...
68,Guardians of the Galaxy Dancing Groot Figure,Toys & Games,https://www.amazon.com/dp/B00QYHMWNQ/ref=cm_sw...,2.0,1
302,Cinelinx: A Card Game for People Who Love Movi...,Toys & Games,https://www.amazon.com/Cinelinx-Card-Game-Peop...,1.0,1
69,Final Fantasy XV Deluxe Edition - PlayStation 4,Video Games,https://www.amazon.com/Final-Fantasy-XV-Deluxe...,2.0,1
105,Ghostbusters: The Video Game [Download],Video Games,https://www.amazon.com/dp/B0044DEQ3Q,1.0,1
147,TRON: Evolution - Playstation 3,Video Games,https://www.amazon.com/TRON-Evolution-Playstat...,1.0,1

# Data Reading and Writting

In [159]:
df2=pd.read_table("OneDrive/Desktop/New folder/Session3/dataset/data.txt")
df2

     1,13,21,11,196,75,4,3,34,6,7,8,0,1,2,3,4,5
0  3,42,12,33,766,75,4,55,6,4,3,4,5,6,7,0,11,12
1  1,22,33,11,999,11,2,1,78,0,1,2,9,8,7,1,76,88

In [161]:
df2 = pd.read_table("OneDrive/Desktop/New folder/Session3/dataset/data.txt", sep=",")
df2

   1  13  21  11  196  75  4   3  34  6  7  8  0  1.1  2  3.1  4.1   5
0  3  42  12  33  766  75  4  55   6  4  3  4  5    6  7    0   11  12
1  1  22  33  11  999  11  2   1  78  0  1  2  9    8  7    1   76  88

In [162]:
df=pd.read_table( 
                    "OneDrive/Desktop/New folder/Session3/dataset/data.txt",
                     sep=",",
                     header=None
                )
df

   0   1   2   3    4   5   6   7   8   9   10  11  12  13  14  15  16  17
0   1  13  21  11  196  75   4   3  34   6   7   8   0   1   2   3   4   5
1   3  42  12  33  766  75   4  55   6   4   3   4   5   6   7   0  11  12
2   1  22  33  11  999  11   2   1  78   0   1   2   9   8   7   1  76  88

In [164]:
df=pd.read_table(
                    "OneDrive/Desktop/New folder/Session3/dataset/data.txt",
                     sep=",",
                     header=None, 
                     names=["name","score","sex", "something"]
                )
df

                                     name  score  sex  something
1 13 21 11 196 75 4 3  34 6 7 8 0 1     2      3    4          5
3 42 12 33 766 75 4 55 6  4 3 4 5 6     7      0   11         12
1 22 33 11 999 11 2 1  78 0 1 2 9 8     7      1   76         88

## Writing Data

In [167]:
df.to_csv("OneDrive/Desktop/New folder/Session3/dataset/new_data.csv")

# Missing Data

In [169]:
from numpy import nan as NA

In [170]:
df = pd.DataFrame(
                    [
                        [1,2,3],
                        [4,NA,5],
                        [NA,NA,NA]
                    ]
                 )
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [171]:
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [172]:
df.dropna(how="all")

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [174]:
df[1] = NA

df

     0   1    2
0  1.0 NaN  3.0
1  NaN NaN  NaN
2  NaN NaN  NaN

In [173]:
df.iloc[1] = NA

df

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  NaN
2  NaN  NaN  NaN

In [175]:
df.dropna(axis=1,how="all")

     0    2
0  1.0  3.0
1  NaN  NaN
2  NaN  NaN

In [182]:
df.dropna( thresh = 0 )            # Drops the columns which contain NA equal or greater than the "thresh" value.

     0   1    2
0  1.0 NaN  3.0
1  NaN NaN  NaN
2  NaN NaN  NaN

In [183]:
df.fillna(0)

     0    1    2
0  1.0  0.0  3.0
1  0.0  0.0  0.0
2  0.0  0.0  0.0

In [184]:
df.fillna({0:15,1:25,2:35})

      0     1     2
0   1.0  25.0   3.0
1  15.0  25.0  35.0
2  15.0  25.0  35.0

In [185]:
df

     0   1    2
0  1.0 NaN  3.0
1  NaN NaN  NaN
2  NaN NaN  NaN

In [186]:
df.fillna(0,inplace=True)

In [187]:
df

     0    1    2
0  1.0  0.0  3.0
1  0.0  0.0  0.0
2  0.0  0.0  0.0

# Data Transformation

In [189]:
data = pd.DataFrame(
                        {
                            "a":["one","two"] * 3,
                            "b":[1,1,2,3,2,8]
                        }
                    )
data

     a  b
0  one  1
1  two  1
2  one  2
3  two  3
4  one  2
5  two  8

In [191]:
data.duplicated()                # Returs boolean value of True if a row is repeating otherwise False

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [192]:
data.drop_duplicates()

     a  b
0  one  1
1  two  1
2  one  2
3  two  3
5  two  8

# Combining and Merging Datasets

In [193]:
import pandas as pd
import numpy as np

## Joining DataFrame

In [194]:
d1=pd.DataFrame(
                    {
                        "key":["a","b","c","c","d","e"],
                         "num1":range(6)
                    }
                )


d2 = pd.DataFrame(
                    {
                        "key":["b","c","e","f"],
                         "num2":range(4)
                    }
                )

In [195]:
print(d1)
print(d2)

  key  num1
0   a     0
1   b     1
2   c     2
3   c     3
4   d     4
5   e     5
  key  num2
0   b     0
1   c     1
2   e     2
3   f     3

In [196]:
pd.merge(d1, d2)

  key  num1  num2
0   b     1     0
1   c     2     1
2   c     3     1
3   e     5     2

In [197]:
pd.merge(d1, d2, on='key')

  key  num1  num2
0   b     1     0
1   c     2     1
2   c     3     1
3   e     5     2